{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for the Lasereraa website including homepage, services, products, industrial design theme, and contact sections with high confidence mappings to source files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing the structure and purpose of each component, style, and configuration file in the Lasereraa website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining an industrial design system using OKLCH color space for light and dark themes with metallic tones and laser orange accents.",
  "frontend/index.html": "HTML entry point for the React application with basic meta tags, title, root div, and module script reference.",
  "frontend/src/App.tsx": "Root React component that assembles the complete single-page application by rendering Header, Hero, Services, Products, Contact, and Footer components in sequence.",
  "frontend/src/components/Contact.tsx": "Contact section component displaying company contact information (email, phone, location, hours), domain name, and call-to-action button with industrial-themed styling.",
  "frontend/src/components/Footer.tsx": "Footer component with brand logo, service/product links, social media icons, domain reference with UTM tracking, and Caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with Lasereraa logo, domain display, responsive mobile menu, smooth scroll navigation to sections, and 'Get Quote' CTA button.",
  "frontend/src/components/Hero.tsx": "Hero section component with background image, headline, CTA buttons for quote/services, and three feature pills (High Precision, Multi-Material, Custom Solutions) with smooth scroll navigation.",
  "frontend/src/components/Products.tsx": "Products section showcasing custom gift items with two categories (Corporate Gift Items and Customizable Gifts), a hero image, and feature highlights for premium quality and bulk orders.",
  "frontend/src/components/Services.tsx": "Services section displaying three laser cutting service cards (Metal, MDF, Acrylic) with icons, descriptions, features, and feature images in a grid layout.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor using React Query, handling both authenticated and anonymous actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom industrial design system including light/dark themes, laser orange accent colors, steel gray palette, and typography utilities using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with industrial design tokens (laser-orange, industrial-border), custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file defining Lasereraa as a professional industrial laser cutting services website with features for hero section, services display (metal/MDF/acrylic cutting), corporate gifts showcase, industrial design theme, and contact section."
}